{"posts":[{"title":"To Do List","text":"to do list 模型训练以及测试。（测试加了我们的方法的pconv） 读两篇论文（diffusion读一读） 在celebahq数据集上训练几个baseline","link":"/2023/02/07/demo-1/"},{"title":"Brand New Start","text":"写一些废话在前面： 好久没有写博客了，也很久没有更新个人博客。之前这个站点的内容已经找不到了（大多数是关于深度学习和目标检测的，还有本科做的一些Toy-Project），索性从头配置，把之前的内容全部删除掉了，也算是一个新的开始。 这个博客主题是ICARUS赛博朋克版本，决定以后一直用下去了。我笔记本的桌面也是一张赛博朋克风的图，用了很久。最初选择计算机专业，是因为高中时在Coursera自学过前端的课程，当时觉得好有趣，而且我从小就喜欢打游戏;)。后来接触AI，心中便种下了一颗赛博朋克梦，又回到了Coursera，从吴恩达老师的经典《Deep Learning》学起，时常觉得和CS这个学科在冥冥之中有着不解之缘。 虽然大学四年在学业上取得了不错的成绩（刚入学的我数学垫底，及格都会眉飞色舞的开心好一阵，到最后专业第三，还保研到了复旦），可CS毕竟是一门实践学科，四年光阴拿去卷成绩、参加社团活动、各地旅行、认识有趣的人，也算是过的快乐且丰富多彩，但技术上的长进确实不多，背负科班的名号还是有些惭愧的，而成为技术大牛需要夜以继日的持续努力和实践。 22岁，读了研究生，开始认真思考未来的职业规划。 是做一些开源项目，背八股刷leetcode，去面试前端后端？（虽然业务场景广泛，绩效清晰，但前端容易被替代，后端技术繁琐，还是要看业务线，以及需求来做事，最终成为螺丝钉，在国内还有裁员风险。） 是赶快水两篇文章，背八股文刷leetcode，去面试算法工程师？（虽然和研究方向沾边，但已经卷成麻花，且没有什么好的业务能落地，移动互联网红利期结束，AI不再像过去一样能圈很多钱，面向落地和前后端没区别，面向算法的炼丹师能让人焦虑的要死，一个月没什么指标提升就可以考虑如何体面的离职了） 是疯狂水文章，读博士，然后再去工业界/学术界呢？ 是在国内卷，还是润出去呢？ 是直接躺平去央企国企银行，考公务员呢？还是继续在大厂卷技术产品经理？ …… 你看，成长最讨厌的，就是把我们变成现实、唯结果论、喜欢分析利弊的大人。在这个极度内卷的时代，这是生存下去的必要品质，但上述所提到的也不过是一些同质化竞争。我们焦虑，我们张口闭口提八股文leetcode、CCF-A论文×N、50w的package、大厂实习和转正，好像这些是衡量人生成功与否唯一的标志，早就把热爱二字抛到九霄云外了，这里的热爱可不是“为的就是这块技术“，现实主义和理想主义从来都不是二选一问题。人变老的标志不是年龄的增长，而是现实消磨掉了你原本拥有的理想主义。 最后再引两段我很喜欢的话，作为过去的结束语，以及未来的开场白： “那一天我二十一岁，在我一生的黄金时代。我有好多奢望。我想爱，想吃，还想在一瞬间变成天上半明半暗的云。后来我才知道，生活就是个缓慢受锤的过程，人一天天老下去，奢望也一天天消失，最后变得像挨了锤的牛一样。可是我过二十一岁生日时没有预见到这一点。我觉得自己会永远生猛下去，什么也锤不了我。“ “回头看他人生的故事的时候，我们或许觉得传奇精彩，可是带入来看却会发现他在面临每一个人生岔路口时，做出的每一个决定需要付出多大的勇气。都说人生任何时候开始都不晚，或许前提是那个人背负着巨大的足以支撑其走到最后的信念和梦想。毕竟人生区区百年，只争朝夕。“ 与君共勉。 2023.02.07 于广州。","link":"/2023/02/07/2302072144/"},{"title":"ChatGPT使用体验以及重拾Hexo遇到的坑","text":"ChatGPT注册 用Microsoft Edge、Google Chrome浏览器。 美区的VPN，开全局模式。 ChatGPT: Optimizing Language Models for Dialogue (openai.com)👉TRY CHATGPT Button。 如遇到ChatGPT is at capacity right now问题，多刷新几次页面就能进去。 利用Google账号直接登录。 利用SMS-Activate，下载桌面版软件（网页版做的太烂了），充值0.2刀（支持支付宝），买一个印度区的openai短信服务（最便宜），就可以完成注册了。 如遇到We're experiencing exceptionally high demand. Please hang tight as we work on scaling our systems.，Too many requests in 1 hour. Try again later.问题 换梯子、换浏览器，清除cookie和其他站点数据（短时间能解决问题） 花钱买api接口调用（不过马上就要上线付费版的chatgpt pro了？） 尽量白天使用，晚上别用（用的人太多了，尤其是美国娃，别抢了） 实在不行淘宝等平台买新号用吧。 ChatGPT使用体验 最初试用ChatGPT时，仅仅让它续写故事，做内容生成。发现是在一本正经的胡说八道，于是就没有再继续使用了。 后来才发现是使用的方法不对。具体可以参考f/awesome-chatgpt-prompts: This repo includes ChatGPT prompt curation to use ChatGPT better. (github.com)，里面涉及了ChatGPT可以完成的许多内容。 最近看微软将ChatGPT集成到Bing搜索，以及谷歌等巨头公司做出的一系列举动，发现ChatGPT开启了新的交互式搜索范式，这是让剩下的搜索引擎巨头倍感焦虑的问题。 关于ChatGPT的编码能力，我觉得很适合辅助入门者进行代码的学习，但是复杂一点的问题它就没办法解决了。 不管是用YouTube、Google、StackOverflow、GitHub，还是ChatGPT辅助编码，问问题的能力永远比答案更重要，所以搜索引擎是一种工具。这些工具的诞生能够将简单的、重复性的工作解决掉，所以不愿意终身学习的躺平er们要小心了，在不久的将来，可能就要被代替掉了。 Hexo插入图片遇到的坑参考 hexo3 - hexo图片路径问题 - SegmentFault 思否 域名是xxx.io的情况下，图片路径会从原本/xxx.jpg变成 /.io/xxx.jpg · Issue #47 · xcodebuild/hexo-asset-image (github.com) 直接卸载hexo-asset-image插件 1npm uninstall hexo-asset-image --save 将_config.yml中 1post_asset_folder: true md文件中引用格式为 1![](同名文章assetfoldername/imagename.png) 以及需要参考Hexo Icarus主题配置完全手册 | 小贪心 (littlezero.top)，好好学习Icarus主题。 包括 文档 | Hexo Categories - Icarus (ppoffice.github.io) ppoffice/hexo-theme-icarus: A simple, delicate, and modern theme for the static site generator Hexo. (github.com)","link":"/2023/02/07/2302072205/"}],"tags":[{"name":"daily","slug":"daily","link":"/tags/daily/"},{"name":"NLP","slug":"NLP","link":"/tags/NLP/"},{"name":"Hexo","slug":"Hexo","link":"/tags/Hexo/"},{"name":"AboutVanessa","slug":"AboutVanessa","link":"/tags/AboutVanessa/"}],"categories":[{"name":"Util","slug":"Util","link":"/categories/Util/"},{"name":"AboutVanessa","slug":"AboutVanessa","link":"/categories/AboutVanessa/"}],"pages":[]}